'''4. Создать вручную и заполнить несколькими строками текстовый
файл, в котором каждая строка будет содержать данные о фирме: название,
форма собственности, выручка, издержки.
Пример строки файла: firm_1 ООО 10000 5000.

Необходимо построчно прочитать файл, вычислить прибыль каждой
компании, а также среднюю прибыль. Если фирма получила убытки, в расчёт
средней прибыли её не включать.

Далее реализовать список. Он должен содержать словарь с фирмами и
их прибылями, а также словарь со средней прибылью. Если фирма получила
убытки, также добавить её в словарь (со значением убытков).

Пример списка: [{“firm_1”: 5000, “firm_2”: 3000, “firm_3”: 1000},
{“average_profit”: 2000}].
Итоговый список сохранить в виде json-объекта в соответствующий
файл.
Пример json-объекта:
[{"firm_1": 5000, "firm_2": 3000, "firm_3": 1000}, {"average_profit":
2000}]
Подсказка: использовать менеджер контекста. – 1 балл (задача на
оценку 10)'''

import sys
import importlib
sys.path.append('subjects/script-languages')

import functions as f
from functions import print_full_width_line as line
f = importlib.reload(f)


firms_file = open('subjects/script-languages/lr-3-12/task-4/firms.txt', 'r', encoding="utf-8")
json_file = open('subjects/script-languages/lr-3-12/task-4/info.json', 'w+', encoding="utf-8")



